In [4]:
import mysql.connector as sql
import pandas as pd

# auth_plugin is needed, can check by commends 
# SELECT user,authentication_string,plugin,host FROM mysql.user;
# check the columns plugin and user

mydb = sql.connect (
    host = "localhost",
    user = "root",
    password = "ZAQs8271911c$",
    auth_plugin='mysql_native_password',
    database = "sql_intro",
    buffered = True             # Unread result found issue
)                                              # if using pandas no need to use buffer

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x7f7d00fef6a0>

In [5]:
#geting data about those age is more than 30
"""emp_details
Name	Age	sex	doj	city	salary
0	Jimmy	   35	M	 2005-05-30	Chicago	    70000.0
1	Shane	    30	 M	 1999-06-25	Seattle	      55000.0
2	Marry	    28	  F	   2009-03-10 Boston	   62000.0
3	Dwayne	 37	  M	  2011-07-12  Austin	    57000.0
4	Sara	      32	F	 2017-10-27	New York	72000.0
5	Ammy	  35	F	 2014-12-20	Seattle	       80000.0
"""

sql_query = """
select *
from emp_details
where age > 30;
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     Name  Age sex         doj      city   salary
0   Jimmy   35   M  2005-05-30   Chicago  70000.0
1  Dwayne   37   M  2011-07-12    Austin  57000.0
2    Sara   32   F  2017-10-27  New York  72000.0
3    Ammy   35   F  2014-12-20   Seattle  80000.0

# group by
###### cant just group by alone, must do some calculation like count , avg, sum

In [9]:
# group by sex and count number of employees
"""emp_details
Name	Age	sex	doj	city	salary
0	Jimmy	   35	M	 2005-05-30	Chicago	    70000.0
1	Shane	    30	 M	 1999-06-25	Seattle	      55000.0
2	Marry	    28	  F	   2009-03-10 Boston	   62000.0
3	Dwayne	 37	  M	  2011-07-12  Austin	    57000.0
4	Sara	      32	F	 2017-10-27	New York	72000.0
5	Ammy	  35	F	 2014-12-20	Seattle	       80000.0
"""

sql_query = """
select count(name) as number, sex
from emp_details
group by sex;
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   number sex
0       3   M
1       3   F

In [10]:
# group by sex and calculate total salary by gender
"""emp_details
Name	Age	sex	doj	city	salary
0	Jimmy	   35	M	 2005-05-30	Chicago	    70000.0
1	Shane	    30	 M	 1999-06-25	Seattle	      55000.0
2	Marry	    28	  F	   2009-03-10 Boston	   62000.0
3	Dwayne	 37	  M	  2011-07-12  Austin	    57000.0
4	Sara	      32	F	 2017-10-27	New York	72000.0
5	Ammy	  35	F	 2014-12-20	Seattle	       80000.0
"""

sql_query = """
select sum(salary) , sex
from emp_details
group by sex;
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   sum(salary) sex
0     182000.0   M
1     214000.0   F